{
    "back": [
        {
            "bodyPart": "cardio",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/CpsX02T5ixa34c",
            "id": "3672",
            "name": "back and forth step",
            "target": "cardiovascular system",
            "secondaryMuscles": [
                "quadriceps",
                "hamstrings",
                "glutes",
                "calves"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart.",
                "Step forward with your right foot, bending your knee and lowering your body into a lunge position.",
                "Push off with your right foot and step back to the starting position.",
                "Repeat the movement with your left foot, alternating legs with each step.",
                "Continue stepping back and forth, maintaining a steady pace.",
                "Repeat for the desired duration or number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "stability ball",
            "gifUrl": "https://v2.exercisedb.io/image/OZ2b7oB2Isf22k",
            "id": "1314",
            "name": "back extension on exercise ball",
            "target": "spine",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Place the stability ball on the ground and lie face down on top of it, with your hips resting on the ball and your feet against a wall or other stable surface.",
                "Position your hands behind your head or crossed over your chest.",
                "Engage your core and slowly lift your upper body off the ball, extending your back until your body forms a straight line from your head to your heels.",
                "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/hUbam4nVOWvGlt",
            "id": "3297",
            "name": "back lever",
            "target": "upper back",
            "secondaryMuscles": [
                "biceps",
                "forearms",
                "core"
            ],
            "instructions": [
                "Start by hanging from a pull-up bar with an overhand grip, hands slightly wider than shoulder-width apart.",
                "Engage your core and pull your shoulder blades down and back.",
                "Bend your knees and tuck them towards your chest.",
                "Slowly lift your legs up, keeping them straight, until your body is parallel to the ground.",
                "Hold this position for a few seconds, then slowly lower your legs back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/bWhjEKe0cCJ09s",
            "id": "1405",
            "name": "back pec stretch",
            "target": "lats",
            "secondaryMuscles": [
                "shoulders",
                "chest"
            ],
            "instructions": [
                "Stand tall with your feet shoulder-width apart.",
                "Extend your arms straight out in front of you, parallel to the ground.",
                "Cross your arms in front of your body, with your right arm over your left arm.",
                "Interlock your fingers and rotate your palms away from your body.",
                "Slowly raise your arms up and away from your body, feeling a stretch in your back and chest.",
                "Hold the stretch for 15-30 seconds, then release.",
                "Repeat on the opposite side."
            ]
        },
        {
            "bodyPart": "upper legs",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/r1baTiudLnPcu7",
            "id": "1473",
            "name": "backward jump",
            "target": "quads",
            "secondaryMuscles": [
                "hamstrings",
                "glutes",
                "calves"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart.",
                "Bend your knees slightly and jump backwards, pushing off with both feet.",
                "Land softly on the balls of your feet, bending your knees to absorb the impact.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "band",
            "gifUrl": "https://v2.exercisedb.io/image/cAXt7zQTO0Ma5k",
            "id": "3117",
            "name": "band fixed back close grip pulldown",
            "target": "lats",
            "secondaryMuscles": [
                "biceps",
                "forearms"
            ],
            "instructions": [
                "Attach the band to a fixed point above you, such as a pull-up bar or sturdy beam.",
                "Sit down on a bench or chair facing the band, with your feet flat on the ground and your knees bent.",
                "Grasp the band with a close grip, palms facing towards you.",
                "Keep your back straight and engage your core.",
                "Pull the band down towards your chest, squeezing your shoulder blades together.",
                "Pause for a moment at the bottom of the movement, feeling the contraction in your lats.",
                "Slowly release the band back to the starting position, maintaining control throughout the movement.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "band",
            "gifUrl": "https://v2.exercisedb.io/image/4eg4Jrmt5z8HNr",
            "id": "3116",
            "name": "band fixed back underhand pulldown",
            "target": "lats",
            "secondaryMuscles": [
                "biceps",
                "rhomboids",
                "rear deltoids"
            ],
            "instructions": [
                "Attach the band to a sturdy anchor point above your head.",
                "Stand facing the anchor point with your feet shoulder-width apart.",
                "Grasp the band with an underhand grip, hands slightly wider than shoulder-width apart.",
                "Step back to create tension in the band, keeping your arms fully extended.",
                "Engage your core and squeeze your shoulder blades together.",
                "Pull the band down towards your chest, leading with your elbows.",
                "Pause for a moment at the bottom of the movement, feeling the contraction in your lats.",
                "Slowly release the tension in the band and return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper legs",
            "equipment": "band",
            "gifUrl": "https://v2.exercisedb.io/image/uT1efUWQdkrp6r",
            "id": "1023",
            "name": "band straight back stiff leg deadlift",
            "target": "glutes",
            "secondaryMuscles": [
                "hamstrings",
                "lower back"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and place the band around your upper legs.",
                "Hold the band with both hands in front of your thighs, palms facing your body.",
                "Keeping your back straight and your knees slightly bent, hinge at the hips and lower the band towards the ground.",
                "Feel the stretch in your hamstrings as you lower the band.",
                "Engage your glutes and hamstrings to lift your body back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper legs",
            "equipment": "barbell",
            "gifUrl": "https://v2.exercisedb.io/image/AAWzgxwLmqmDdE",
            "id": "1461",
            "name": "barbell full squat (back pov)",
            "target": "glutes",
            "secondaryMuscles": [
                "quadriceps",
                "hamstrings",
                "calves",
                "core"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, toes slightly turned out.",
                "Hold the barbell across your upper back, resting it on your traps or rear delts.",
                "Engage your core and keep your chest up as you begin to lower your body down.",
                "Bend at the knees and hips, pushing your hips back and down as if sitting into a chair.",
                "Lower your body until your thighs are parallel to the ground or slightly below.",
                "Keep your knees in line with your toes and your weight in your heels.",
                "Drive through your heels to stand back up, extending your hips and knees.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "barbell",
            "gifUrl": "https://v2.exercisedb.io/image/8NnfkaJFJui-QT",
            "id": "1720",
            "name": "barbell lying back of the head tricep extension",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Lie flat on a bench with your feet flat on the ground and your head at the end of the bench.",
                "Hold a barbell with an overhand grip, hands shoulder-width apart, and extend your arms straight up over your chest.",
                "Keeping your upper arms stationary, slowly lower the barbell behind your head by bending your elbows.",
                "Pause for a moment, then extend your arms back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "lower arms",
            "equipment": "barbell",
            "gifUrl": "https://v2.exercisedb.io/image/ZnwJCvFI7uTkeM",
            "id": "0104",
            "name": "barbell standing back wrist curl",
            "target": "forearms",
            "secondaryMuscles": [
                "biceps",
                "shoulders"
            ],
            "instructions": [
                "Stand up straight with your feet shoulder-width apart and hold a barbell with an overhand grip.",
                "Rest the barbell on the back of your hands with your palms facing down and your fingers pointing towards your body.",
                "Keeping your upper arms stationary, exhale and curl your wrists upwards as far as possible.",
                "Hold the contracted position for a brief pause, then inhale and slowly lower the barbell back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/Dd2goKHUWmzsLV",
            "id": "0860",
            "name": "cable kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand facing a cable machine with your feet shoulder-width apart.",
                "Hold the cable handle with your right hand and step back to create tension in the cable.",
                "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
                "Keep your upper arm close to your body and your elbow bent at a 90-degree angle.",
                "Extend your forearm backward, straightening your arm fully.",
                "Pause for a moment, then slowly return to the starting position.",
                "Repeat for the desired number of repetitions, then switch sides."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/1ZM3QOzTZetEFU",
            "id": "0193",
            "name": "cable one arm straight back high row (kneeling)",
            "target": "upper back",
            "secondaryMuscles": [
                "biceps",
                "shoulders"
            ],
            "instructions": [
                "Attach a handle to a cable machine at waist height.",
                "Kneel down facing the cable machine and grab the handle with one hand.",
                "Keep your back straight and your core engaged.",
                "Pull the handle towards your chest, squeezing your shoulder blades together.",
                "Pause for a moment at the top of the movement.",
                "Slowly release the handle back to the starting position.",
                "Repeat for the desired number of repetitions.",
                "Switch sides and repeat the exercise with the other arm."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/IWOQ0OTG6ZF-rh",
            "id": "0208",
            "name": "cable reverse-grip straight back seated high row",
            "target": "upper back",
            "secondaryMuscles": [
                "biceps",
                "forearms"
            ],
            "instructions": [
                "Sit on the seat facing the cable machine with your feet flat on the floor.",
                "Grasp the cable attachment with an underhand grip, palms facing up, and your hands shoulder-width apart.",
                "Keep your back straight and lean slightly forward from your hips.",
                "Pull the cable towards your torso by retracting your shoulder blades and squeezing your back muscles.",
                "Pause for a moment at the peak of the contraction, then slowly release the cable back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "lower arms",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/ForgG5CuxtIUaV",
            "id": "0224",
            "name": "cable standing back wrist curl",
            "target": "forearms",
            "secondaryMuscles": [
                "biceps",
                "brachialis"
            ],
            "instructions": [
                "Stand facing a cable machine with your feet shoulder-width apart.",
                "Hold the cable handle with an overhand grip, palms facing down.",
                "Keep your arms straight and your elbows close to your sides.",
                "Slowly curl your wrists upward, bringing the cable handle towards your body.",
                "Pause for a moment at the top, then slowly lower the cable handle back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/E4e-dbQ9HfA7Jz",
            "id": "0239",
            "name": "cable straight back seated row",
            "target": "upper back",
            "secondaryMuscles": [
                "biceps",
                "forearms",
                "shoulders"
            ],
            "instructions": [
                "Sit on the cable row machine with your feet flat on the footrests and your knees slightly bent.",
                "Grasp the cable handles with an overhand grip, palms facing down.",
                "Keep your back straight and lean slightly forward from the hips.",
                "Pull the cable handles towards your body, squeezing your shoulder blades together.",
                "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/sc-jV5IXN7WS2V",
            "id": "1728",
            "name": "cable two arm tricep kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and knees slightly bent.",
                "Hold the cable handle in each hand with your palms facing inwards and your arms bent at a 90-degree angle.",
                "Keeping your upper arms stationary, extend your forearms backwards until your arms are fully extended.",
                "Pause for a moment, then slowly return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/ctPScWMj3iOZH9",
            "id": "0333",
            "name": "dumbbell kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and hold a dumbbell in each hand.",
                "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
                "Bring your upper arms close to your sides, with your elbows bent at a 90-degree angle.",
                "Extend your arms straight back, squeezing your triceps at the top of the movement.",
                "Pause for a moment, then slowly lower the dumbbells back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/cA9K6SktYVaQVH",
            "id": "1734",
            "name": "dumbbell kickbacks on exercise ball",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders",
                "back"
            ],
            "instructions": [
                "Sit on an exercise ball with your feet flat on the ground and your back straight.",
                "Hold a dumbbell in each hand with your palms facing inwards and your arms bent at a 90-degree angle.",
                "Extend your arms straight back, squeezing your triceps at the top of the movement.",
                "Pause for a moment, then slowly lower the dumbbells back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/JhfW2hIvwFMkK4",
            "id": "0354",
            "name": "dumbbell one arm kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and hold a dumbbell in your right hand.",
                "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
                "Bring your right elbow up to your side, keeping it bent at a 90-degree angle.",
                "Extend your right arm straight back, squeezing your triceps at the top of the movement.",
                "Slowly lower the dumbbell back to the starting position.",
                "Repeat for the desired number of repetitions, then switch sides."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/uHei5PhS2yuHE9",
            "id": "1730",
            "name": "dumbbell seated bent over alternate kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders",
                "back"
            ],
            "instructions": [
                "Sit on a bench with a dumbbell in each hand, palms facing inwards.",
                "Bend forward at the waist, keeping your back straight and parallel to the ground.",
                "Extend one arm straight back, keeping it close to your body, until your arm is fully extended.",
                "Pause for a moment, then slowly lower the dumbbell back to the starting position.",
                "Repeat with the other arm.",
                "Continue alternating arms for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/KfNzcKI88PDS9h",
            "id": "0394",
            "name": "dumbbell seated kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Sit on a bench with your feet flat on the ground and hold a dumbbell in each hand.",
                "Bend your knees slightly and lean forward from your hips, keeping your back straight.",
                "Bring your upper arms close to your sides and keep your elbows bent at a 90-degree angle.",
                "Extend your arms straight back, squeezing your triceps at the top of the movement.",
                "Pause for a moment, then slowly lower the dumbbells back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/YYxIUNZNYWpXeI",
            "id": "0398",
            "name": "dumbbell seated one arm kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Sit on a bench with your feet flat on the ground and hold a dumbbell in one hand.",
                "Bend your torso forward at the waist, keeping your back straight and parallel to the ground.",
                "Extend your arm straight back, keeping your elbow close to your body.",
                "Pause for a moment at the top, then slowly lower the dumbbell back to the starting position.",
                "Repeat for the desired number of repetitions, then switch arms."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/HsRnmAAET6mojo",
            "id": "1739",
            "name": "dumbbell standing alternating tricep kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, holding a dumbbell in each hand.",
                "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
                "Extend your arms straight back, keeping your elbows close to your body.",
                "Pause for a moment at the top, then slowly lower the dumbbells back to the starting position.",
                "Repeat with the other arm, alternating sides with each repetition."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/-pFh6whZ17gfY2",
            "id": "0420",
            "name": "dumbbell standing kickback",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and hold a dumbbell in each hand.",
                "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
                "Extend your arms straight back, squeezing your triceps at the top of the movement.",
                "Pause for a moment, then slowly lower the dumbbells back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/FkIsvExpqRteio",
            "id": "1742",
            "name": "dumbbell tricep kickback with stork stance",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and hold a dumbbell in your right hand.",
                "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
                "Bring your right elbow up to your side, keeping it bent at a 90-degree angle.",
                "Extend your right arm straight back, squeezing your triceps.",
                "Pause for a moment, then slowly lower the dumbbell back to the starting position.",
                "Repeat for the desired number of repetitions, then switch sides."
            ]
        },
        {
            "bodyPart": "shoulders",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/2UbcCv5TnvZpBz",
            "id": "1765",
            "name": "dumbbell upright row (back pov)",
            "target": "delts",
            "secondaryMuscles": [
                "traps",
                "biceps"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with an overhand grip.",
                "Let the dumbbells hang in front of your thighs, with your arms fully extended and your palms facing your body.",
                "Keeping your back straight and your core engaged, exhale and lift the dumbbells straight up towards your chin, leading with your elbows.",
                "Continue lifting until the dumbbells are at shoulder height, with your elbows pointing out to the sides.",
                "Pause for a moment at the top, then inhale and slowly lower the dumbbells back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "stability ball",
            "gifUrl": "https://v2.exercisedb.io/image/tMHWqBquljPpDY",
            "id": "1333",
            "name": "exercise ball back extension with arms extended",
            "target": "spine",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Place the stability ball on the ground and lie face down on top of it, with your hips resting on the ball and your feet against a wall for stability.",
                "Extend your arms straight out in front of you, with your palms facing down.",
                "Engage your core and slowly lift your upper body off the ball, keeping your back straight and your neck in line with your spine.",
                "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "stability ball",
            "gifUrl": "https://v2.exercisedb.io/image/hcUVkN0Qt7qG3u",
            "id": "1334",
            "name": "exercise ball back extension with hands behind head",
            "target": "spine",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Place the stability ball on the ground and lie face down on top of it with your hips resting on the ball.",
                "Position your feet against a wall or other stable surface for support.",
                "Cross your arms behind your head, with your hands touching the back of your head.",
                "Engage your core and slowly lift your upper body off the ball, extending your back until your body forms a straight line from your head to your hips.",
                "Pause for a moment at the top of the movement, then slowly lower your upper body back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "stability ball",
            "gifUrl": "https://v2.exercisedb.io/image/yXLxhuDDZGiJct",
            "id": "1335",
            "name": "exercise ball back extension with knees off ground",
            "target": "spine",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Place the stability ball on the ground and lie face down on top of it, with your hips resting on the ball and your feet against a wall for stability.",
                "Position your hands behind your head or crossed over your chest.",
                "Engage your core and slowly lift your upper body off the ball, extending your back until your body forms a straight line from your head to your heels.",
                "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "stability ball",
            "gifUrl": "https://v2.exercisedb.io/image/jHBkyQ-7cJGood",
            "id": "1336",
            "name": "exercise ball back extension with rotation",
            "target": "spine",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Start by lying face down on the stability ball with your hips resting on the ball and your feet firmly planted on the ground.",
                "Place your hands behind your head or cross them over your chest.",
                "Engage your core and slowly lift your upper body off the ball, extending your back until your body forms a straight line from your head to your heels.",
                "Pause for a moment at the top, then slowly rotate your torso to one side, keeping your hips and legs stable.",
                "Return to the center and repeat the rotation to the other side.",
                "Lower your upper body back down to the starting position and repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "stability ball",
            "gifUrl": "https://v2.exercisedb.io/image/7Y164JtEsZ7oWu",
            "id": "1341",
            "name": "exercise ball lower back stretch (pyramid)",
            "target": "lats",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Sit on the stability ball with your feet flat on the ground and your knees bent at a 90-degree angle.",
                "Slowly walk your feet forward, rolling the ball down your back until your lower back is resting on the ball.",
                "Place your hands behind your head or cross them over your chest.",
                "Engage your core and slowly lower your upper body towards the ground, allowing your lower back to stretch over the ball.",
                "Hold the stretch for a few seconds, then slowly return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/EJmb3LjMwbGS61",
            "id": "0573",
            "name": "lever back extension",
            "target": "spine",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Adjust the machine to fit your body size and range of motion.",
                "Sit on the machine with your back against the pad and your feet secured.",
                "Place your hands on the handles or grip bars.",
                "Engage your core and slowly lean forward, allowing your back to round slightly.",
                "Pause for a moment at the bottom position, feeling a stretch in your lower back.",
                "Using your back muscles, slowly raise your torso back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/jghphAQ1iR1UEl",
            "id": "1352",
            "name": "lower back curl",
            "target": "spine",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Lie flat on your stomach with your legs extended and your arms by your sides.",
                "Engage your glutes and hamstrings, and slowly lift your upper body off the ground, curling your back upwards.",
                "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "resistance band",
            "gifUrl": "https://v2.exercisedb.io/image/MR5zf14MDnpxMD",
            "id": "3144",
            "name": "resistance band seated straight back row",
            "target": "upper back",
            "secondaryMuscles": [
                "biceps",
                "shoulders"
            ],
            "instructions": [
                "Sit on the floor with your legs extended and loop the resistance band around your feet.",
                "Hold the ends of the resistance band with your hands, palms facing each other.",
                "Keep your back straight and lean slightly back, engaging your core.",
                "Pull the resistance band towards your chest, squeezing your shoulder blades together.",
                "Pause for a moment at the top, then slowly release the tension and return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "roller",
            "gifUrl": "https://v2.exercisedb.io/image/1zzDhIjOFoEyRA",
            "id": "2208",
            "name": "roller back stretch",
            "target": "spine",
            "secondaryMuscles": [
                "hamstrings",
                "glutes"
            ],
            "instructions": [
                "Start by sitting on the ground with your legs extended in front of you.",
                "Place the roller perpendicular to your body, just below your glutes.",
                "Slowly roll your body backwards, allowing the roller to move up your back.",
                "Continue rolling until the roller reaches your upper back.",
                "Pause for a moment, then slowly roll back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/iu7fW1aTSXBNYF",
            "id": "0690",
            "name": "seated lower back stretch",
            "target": "lats",
            "secondaryMuscles": [
                "glutes",
                "hamstrings"
            ],
            "instructions": [
                "Sit on the edge of a chair with your feet flat on the ground.",
                "Place your hands on your thighs or on the sides of the chair for support.",
                "Slowly lean forward from your hips, keeping your back straight.",
                "Feel the stretch in your lower back and hold for 20-30 seconds.",
                "Slowly return to the starting position and repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper legs",
            "equipment": "sled machine",
            "gifUrl": "https://v2.exercisedb.io/image/bDmwCOIZrkX7ku",
            "id": "1464",
            "name": "sled 45в° leg press (back pov)",
            "target": "glutes",
            "secondaryMuscles": [
                "quadriceps",
                "hamstrings",
                "calves"
            ],
            "instructions": [
                "Adjust the seat of the sled machine so that your knees are at a 45-degree angle.",
                "Sit on the sled machine with your back against the backrest and your feet shoulder-width apart on the footplate.",
                "Grip the handles on the sides of the seat for stability.",
                "Push the footplate away from your body by extending your legs, keeping your heels on the footplate.",
                "Pause for a moment at the fully extended position.",
                "Slowly bend your knees and lower the footplate back towards your body, controlling the movement.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "smith machine",
            "gifUrl": "https://v2.exercisedb.io/image/vlfajdnmECoekL",
            "id": "0746",
            "name": "smith back shrug",
            "target": "traps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and your knees slightly bent.",
                "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
                "Keep your arms straight and allow the barbell to hang in front of your thighs.",
                "Lift your shoulders straight up towards your ears, squeezing your traps at the top.",
                "Hold for a moment, then lower your shoulders back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "lower arms",
            "equipment": "smith machine",
            "gifUrl": "https://v2.exercisedb.io/image/0aZ2FtM-hRXlni",
            "id": "0771",
            "name": "smith standing back wrist curl",
            "target": "forearms",
            "secondaryMuscles": [
                "biceps",
                "triceps"
            ],
            "instructions": [
                "Stand facing the smith machine with your feet shoulder-width apart.",
                "Grasp the barbell with an overhand grip, hands shoulder-width apart.",
                "Keep your back straight and your elbows close to your body.",
                "Slowly curl your wrists upwards, bringing the barbell towards your body.",
                "Pause for a moment at the top, then slowly lower the barbell back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        }
    ],
    "cardio": [],
    "chest": [
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/8BWe84kI5uyHyz",
            "id": "0009",
            "name": "assisted chest dip (kneeling)",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the machine to your desired height and secure your knees on the pad.",
                "Grasp the handles with your palms facing down and your arms fully extended.",
                "Lower your body by bending your elbows until your upper arms are parallel to the floor.",
                "Pause for a moment, then push yourself back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/-OPGg07Wgm7xtd",
            "id": "2364",
            "name": "assisted wide-grip chest dip (kneeling)",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the machine to your desired height and secure your knees on the pad.",
                "Grasp the handles with a wide grip and keep your elbows slightly bent.",
                "Lower your body by bending your elbows until your upper arms are parallel to the floor.",
                "Push yourself back up to the starting position by extending your arms.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "band",
            "gifUrl": "https://v2.exercisedb.io/image/awz1ukk2hiTl9m",
            "id": "0989",
            "name": "band one arm twisting chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Attach the band to a sturdy anchor point at chest height.",
                "Stand with your side facing the anchor point and grab the band with one hand.",
                "Step away from the anchor point to create tension in the band.",
                "Position your feet shoulder-width apart and slightly bend your knees.",
                "Bring your hand holding the band across your body, towards the opposite shoulder.",
                "While maintaining tension in the band, push your hand forward and away from your body, extending your arm.",
                "Slowly return to the starting position and repeat for the desired number of repetitions.",
                "Switch sides and repeat the exercise with the other hand."
            ]
        },
        {
            "bodyPart": "upper legs",
            "equipment": "barbell",
            "gifUrl": "https://v2.exercisedb.io/image/6IZS4rZUXojita",
            "id": "0039",
            "name": "barbell front chest squat",
            "target": "glutes",
            "secondaryMuscles": [
                "quadriceps",
                "hamstrings",
                "calves",
                "core"
            ],
            "instructions": [
                "Start by standing with your feet shoulder-width apart, toes slightly turned out.",
                "Hold the barbell in front of your chest with your hands shoulder-width apart, elbows pointing forward.",
                "Engage your core and keep your chest up as you lower your body down into a squat position, pushing your hips back and bending your knees.",
                "Lower until your thighs are parallel to the ground, or as low as you can comfortably go.",
                "Pause for a moment at the bottom, then push through your heels to return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "assisted",
            "gifUrl": "https://v2.exercisedb.io/image/0DHWzt11NfHBYJ",
            "id": "1259",
            "name": "behind head chest stretch",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Stand tall with your feet shoulder-width apart.",
                "Interlace your fingers behind your head with your elbows pointing outwards.",
                "Slowly squeeze your shoulder blades together and push your chest forward.",
                "Hold the stretch for 15-30 seconds.",
                "Release the stretch and repeat as desired."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/lyjodWxh74rIk4",
            "id": "1262",
            "name": "cable one arm decline chest fly",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Attach a D-handle to a low pulley cable machine and set the bench to a decline angle.",
                "Lie down on the bench with your head towards the machine and grab the handle with your right hand.",
                "Extend your arm straight up above your chest, keeping a slight bend in your elbow.",
                "With a controlled motion, lower your arm out to the side until your hand is in line with your shoulder.",
                "Pause for a moment, then reverse the motion and bring your arm back to the starting position.",
                "Repeat for the desired number of repetitions, then switch to your left arm and repeat the exercise."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/LsN3rSHwRQDiS-",
            "id": "2144",
            "name": "cable seated chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Adjust the seat height and cable handles to a comfortable position.",
                "Sit on the bench with your back straight and feet flat on the floor.",
                "Grasp the cable handles with an overhand grip at shoulder height.",
                "Push the handles forward and away from your body, extending your arms fully.",
                "Pause for a moment, then slowly bring the handles back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/9cTppzS7U8qpDm",
            "id": "1270",
            "name": "cable upper chest crossovers",
            "target": "pectorals",
            "secondaryMuscles": [
                "deltoids",
                "triceps"
            ],
            "instructions": [
                "Attach the handles to the cables at chest height.",
                "Stand in the center of the cable machine with one foot slightly in front of the other.",
                "Grasp the handles with your palms facing down and your arms extended out to the sides.",
                "Keep a slight bend in your elbows and engage your core.",
                "Pull the cables together in front of your chest, crossing them over each other.",
                "Squeeze your chest muscles at the peak of the movement.",
                "Slowly release the cables back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/CbYsiW20X-8ydh",
            "id": "1271",
            "name": "chest and front of shoulder stretch",
            "target": "pectorals",
            "secondaryMuscles": [
                "deltoids"
            ],
            "instructions": [
                "Stand tall with your feet shoulder-width apart.",
                "Extend your arms straight out in front of you at shoulder height.",
                "Cross your arms in front of your body, with your right arm on top of your left arm.",
                "Interlace your fingers and press your palms together.",
                "Gently squeeze your shoulder blades together and push your hands forward, feeling a stretch in your chest and front of your shoulders.",
                "Hold the stretch for 20-30 seconds, then release.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/sTmixldrLzb9HG",
            "id": "0251",
            "name": "chest dip",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Position yourself on parallel bars with your arms fully extended and your body straight.",
                "Lower your body by bending your elbows until your shoulders are below your elbows.",
                "Push yourself back up to the starting position by straightening your arms.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/P1bU0HB9-K2LOS",
            "id": "1430",
            "name": "chest dip (on dip-pull-up cage)",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the dip bars to a height that allows you to comfortably grip them.",
                "Stand between the bars and place your hands on each bar, slightly wider than shoulder-width apart.",
                "Jump up and straighten your arms, supporting your body weight on the bars.",
                "Bend your knees and cross your ankles behind you.",
                "Lower your body by bending your elbows, keeping your chest up and your shoulders down.",
                "Continue lowering until your shoulders are below your elbows or until you feel a stretch in your chest.",
                "Push through your palms and extend your elbows to raise your body back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/vQfihIqi11Ynrh",
            "id": "2462",
            "name": "chest dip on straight bar",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Grab the parallel bars with your palms facing down and your arms fully extended.",
                "Bend your knees and cross your ankles.",
                "Lower your body by bending your arms until your shoulders are below your elbows.",
                "Push yourself back up to the starting position by straightening your arms.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "stability ball",
            "gifUrl": "https://v2.exercisedb.io/image/2hzpLCjegwG7YS",
            "id": "1272",
            "name": "chest stretch with exercise ball",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Sit on the stability ball with your feet flat on the ground and your back straight.",
                "Hold the exercise ball with both hands and extend your arms straight out in front of you.",
                "Slowly bring the exercise ball towards your chest, feeling a stretch in your chest muscles.",
                "Hold the stretch for a few seconds, then slowly return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/zMO3tSFbdu7i-4",
            "id": "3216",
            "name": "chest tap push-up (male)",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Start in a high plank position with your hands slightly wider than shoulder-width apart and your body in a straight line.",
                "Lower your body towards the ground by bending your elbows, keeping them close to your sides.",
                "As you lower yourself, tap your chest with your right hand.",
                "Push yourself back up to the starting position.",
                "Repeat the movement, this time tapping your chest with your left hand.",
                "Continue alternating sides for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/3MaNjJzhh5DEoz",
            "id": "1286",
            "name": "dumbbell one arm chest fly on exercise ball",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Sit on an exercise ball with a dumbbell in one hand and your feet flat on the ground.",
                "Walk your feet forward, rolling the ball until your upper back is supported on the ball and your head, neck, and shoulders are off the ball.",
                "Extend your arm with the dumbbell straight up above your chest, palm facing inward.",
                "Slowly lower the dumbbell out to the side, keeping a slight bend in your elbow.",
                "Pause for a moment when your arm is parallel to the ground.",
                "Engage your chest muscles to bring the dumbbell back up to the starting position.",
                "Repeat for the desired number of repetitions, then switch arms."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/VQAcLlX2UjkM0D",
            "id": "1287",
            "name": "dumbbell one arm decline chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Lie on a decline bench with a dumbbell in one hand, resting on your chest.",
                "Place your feet flat on the ground and keep your back pressed against the bench.",
                "Extend your arm and push the dumbbell up towards the ceiling, fully extending your elbow.",
                "Pause for a moment at the top, then slowly lower the dumbbell back down to the starting position.",
                "Repeat for the desired number of repetitions, then switch to the other arm."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "dumbbell",
            "gifUrl": "https://v2.exercisedb.io/image/AiOh0gb2xCqG1U",
            "id": "1289",
            "name": "dumbbell one arm incline chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Adjust the incline bench to a 45-degree angle.",
                "Sit on the bench with your back against the pad and feet flat on the ground.",
                "Hold a dumbbell in one hand with an overhand grip, resting it on your shoulder.",
                "Push the dumbbell up and away from your body, extending your arm fully.",
                "Pause for a moment at the top, then slowly lower the dumbbell back down to the starting position.",
                "Repeat for the desired number of repetitions, then switch to the other arm."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/3YwOQzKnvYtVqz",
            "id": "1167",
            "name": "dynamic chest stretch (male)",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Stand tall with your feet shoulder-width apart.",
                "Extend your arms straight out to the sides, parallel to the ground.",
                "Slowly bring your arms forward, crossing them in front of your body.",
                "Feel the stretch in your chest muscles.",
                "Hold the stretch for 10-30 seconds.",
                "Return to the starting position and repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper legs",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/3mozMu5syJAHJK",
            "id": "1418",
            "name": "hug keens to chest",
            "target": "glutes",
            "secondaryMuscles": [
                "hamstrings",
                "quadriceps"
            ],
            "instructions": [
                "Start by standing with your feet shoulder-width apart.",
                "Bend your knees and lower your body down into a squat position.",
                "As you squat down, bring your knees up towards your chest and hug them with your arms.",
                "Hold this position for a moment, then slowly return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/-wsrB020XCNqep",
            "id": "1297",
            "name": "isometric chest squeeze",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and your knees slightly bent.",
                "Extend your arms straight out in front of you, parallel to the ground, with your palms facing each other.",
                "Squeeze your chest muscles together as hard as you can, while keeping your arms straight.",
                "Hold this position for a few seconds, focusing on contracting your chest muscles.",
                "Release the squeeze and relax your chest muscles.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/fMt6PsuKkTxrlQ",
            "id": "0577",
            "name": "lever chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the seat height and position yourself on the machine with your back flat against the pad.",
                "Grasp the handles with an overhand grip and position your elbows at a 90-degree angle.",
                "Push the handles forward until your arms are fully extended, exhaling during the movement.",
                "Pause briefly at the end of the movement, then slowly return to the starting position, inhaling as you do so.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/NuUcWxDOt68F82",
            "id": "0576",
            "name": "lever chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the seat height and position yourself on the machine with your back flat against the pad.",
                "Grasp the handles with an overhand grip and position your elbows at a 90-degree angle.",
                "Push the handles forward until your arms are fully extended, exhaling during the movement.",
                "Pause briefly at the end of the movement, then slowly return to the starting position, inhaling as you do so.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/ox3u2tHlrfKRSt",
            "id": "1300",
            "name": "lever decline chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the seat height and backrest of the leverage machine to a comfortable position.",
                "Sit on the machine with your back against the backrest and your feet flat on the floor.",
                "Grasp the handles with an overhand grip and position your hands slightly wider than shoulder-width apart.",
                "Push the handles forward and away from your body until your arms are fully extended.",
                "Slowly lower the handles back towards your chest, keeping your elbows slightly bent.",
                "Pause for a moment at the bottom, then push the handles back to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/F0vQRt9IpwTMsj",
            "id": "1299",
            "name": "lever incline chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Adjust the seat and backrest of the leverage machine to a comfortable position.",
                "Sit on the machine with your back against the backrest and your feet flat on the floor.",
                "Grasp the handles with an overhand grip and position your hands slightly wider than shoulder-width apart.",
                "Push the handles forward and away from your body until your arms are fully extended.",
                "Pause for a moment, then slowly bend your elbows and lower the handles back towards your chest.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/duIRNbeOJXyR7V",
            "id": "1479",
            "name": "lever incline chest press v. 2",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the seat height and backrest angle on the leverage machine to a comfortable position.",
                "Sit on the machine with your back against the backrest and your feet flat on the floor.",
                "Grasp the handles with an overhand grip and position your hands slightly wider than shoulder-width apart.",
                "Push the handles forward and away from your body until your arms are fully extended, but without locking your elbows.",
                "Pause for a moment at the fully extended position, then slowly bend your elbows and lower the handles back towards your chest.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "waist",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/nH9qvvYFC8xjXs",
            "id": "0595",
            "name": "lever seated crunch (chest pad)",
            "target": "abs",
            "secondaryMuscles": [
                "obliques"
            ],
            "instructions": [
                "Adjust the seat height and chest pad position according to your comfort.",
                "Sit on the machine with your back against the chest pad and your feet flat on the floor.",
                "Grasp the handles or side bars for stability.",
                "Engage your abs and slowly lean back, allowing the chest pad to move with you.",
                "Pause for a moment at the maximum contraction, feeling the tension in your abs.",
                "Slowly return to the starting position by contracting your abs and pulling yourself back up.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/RNXe9ipKajBGkT",
            "id": "3758",
            "name": "lever standing chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Adjust the seat height and position yourself on the machine with your feet flat on the ground.",
                "Grasp the handles with an overhand grip and position your hands at chest level.",
                "Push the handles forward until your arms are fully extended, keeping your elbows slightly bent.",
                "Pause for a moment, then slowly bring the handles back towards your chest, maintaining control throughout the movement.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "leverage machine",
            "gifUrl": "https://v2.exercisedb.io/image/RulSxJqasDA2Dl",
            "id": "1301",
            "name": "machine inner chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Adjust the seat height and position yourself on the machine with your back flat against the pad.",
                "Grasp the handles with an overhand grip and position your elbows at a 90-degree angle.",
                "Push the handles forward until your arms are fully extended, exhaling during the movement.",
                "Pause for a moment at the end of the movement, then slowly return to the starting position, inhaling as you do so.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "medicine ball",
            "gifUrl": "https://v2.exercisedb.io/image/amDKT5kcojxI7W",
            "id": "1302",
            "name": "medicine ball chest pass",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, holding the medicine ball at chest level.",
                "Extend your arms forward, pushing the medicine ball away from your chest with force.",
                "As you release the ball, follow through with your arms and torso, transferring your weight from your back foot to your front foot.",
                "Catch the ball as it rebounds off the wall or partner, and immediately repeat the movement.",
                "Continue for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "medicine ball",
            "gifUrl": "https://v2.exercisedb.io/image/JgfCqmQwBl6mWF",
            "id": "1303",
            "name": "medicine ball chest push from 3 point stance",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Start in a 3 point stance with one hand on the medicine ball and the other hand on the ground.",
                "Extend your legs and position your body in a straight line.",
                "Lower your chest towards the ground while keeping your back straight.",
                "Push the medicine ball away from your body, extending your arm fully.",
                "Return to the starting position and repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "medicine ball",
            "gifUrl": "https://v2.exercisedb.io/image/-8s8aFCtgw29cU",
            "id": "1304",
            "name": "medicine ball chest push multiple response",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, holding a medicine ball at chest level.",
                "Extend your arms forward, pushing the medicine ball away from your chest.",
                "Pause for a moment, then slowly bring the medicine ball back to your chest.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "medicine ball",
            "gifUrl": "https://v2.exercisedb.io/image/EvITJWnISzB9Z6",
            "id": "1305",
            "name": "medicine ball chest push single response",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, holding the medicine ball at chest level.",
                "Extend your arms forward, pushing the medicine ball away from your chest.",
                "Pause for a moment, then slowly bring the medicine ball back to your chest.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "medicine ball",
            "gifUrl": "https://v2.exercisedb.io/image/LRhIbkaFX8X2xC",
            "id": "1312",
            "name": "medicine ball chest push with run release",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders",
                "core"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, holding a medicine ball at chest level.",
                "Step forward with your right foot and simultaneously push the medicine ball forward, extending your arms fully.",
                "As you push the ball forward, release it and let it roll forward.",
                "Quickly run forward and catch the ball before it hits the ground.",
                "Once you catch the ball, bring it back to your chest and repeat the movement with your left foot forward.",
                "Continue alternating legs and repeating the exercise for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "medicine ball",
            "gifUrl": "https://v2.exercisedb.io/image/HMh6wS7KkCfck7",
            "id": "1750",
            "name": "medicine ball supine chest throw",
            "target": "triceps",
            "secondaryMuscles": [
                "chest",
                "shoulders"
            ],
            "instructions": [
                "Lie flat on your back on a bench with your knees bent and feet flat on the ground.",
                "Hold the medicine ball with both hands, extending your arms straight up above your chest.",
                "Lower the medicine ball towards your chest, keeping your elbows close to your body.",
                "Explosively push the medicine ball upwards, extending your arms fully and throwing the ball as high as possible.",
                "Catch the medicine ball and repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "resistance band",
            "gifUrl": "https://v2.exercisedb.io/image/vKHdCExEU8sGvV",
            "id": "3124",
            "name": "resistance band seated chest press",
            "target": "pectorals",
            "secondaryMuscles": [
                "shoulders",
                "triceps"
            ],
            "instructions": [
                "Sit on a chair or bench with your back straight and feet flat on the ground.",
                "Hold the resistance band handles in each hand, with your palms facing down and elbows bent at a 90-degree angle.",
                "Extend your arms forward, pushing the resistance band away from your chest.",
                "Pause for a moment at the end of the movement, then slowly return to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "waist",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/zbiNA2C4N4Q-z7",
            "id": "3679",
            "name": "sit-up with arms on chest",
            "target": "abs",
            "secondaryMuscles": [
                "hip flexors"
            ],
            "instructions": [
                "Lie flat on your back with your knees bent and feet flat on the ground.",
                "Cross your arms over your chest.",
                "Engaging your abs, lift your upper body off the ground towards your knees.",
                "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "chest",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/iJ51B5eT65E2a3",
            "id": "2363",
            "name": "wide-grip chest dip on high parallel bars",
            "target": "pectorals",
            "secondaryMuscles": [
                "triceps",
                "shoulders"
            ],
            "instructions": [
                "Position yourself on the parallel bars with your arms fully extended and your body suspended in the air.",
                "Lean forward slightly and lower your body by bending your elbows until your chest is just above the bars.",
                "Pause for a moment, then push yourself back up to the starting position by straightening your arms.",
                "Repeat for the desired number of repetitions."
            ]
        }
    ],
    "lower arms": [
        {
            "bodyPart": "lower arms",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/Y488rHmBXdweun",
            "id": "1421",
            "name": "modified push up to lower arms",
            "target": "forearms",
            "secondaryMuscles": [
                "triceps",
                "chest",
                "shoulders"
            ],
            "instructions": [
                "Start in a push-up position with your hands directly under your shoulders and your body in a straight line.",
                "Lower your body down towards the ground by bending your elbows, keeping them close to your sides.",
                "Once your elbows are at a 90-degree angle, lower your forearms to the ground, keeping your elbows directly under your shoulders.",
                "Pause for a moment, then push through your palms to lift your forearms back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "upper arms",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/lp0FfVhX4FsEbN",
            "id": "1467",
            "name": "push-up on lower arms",
            "target": "triceps",
            "secondaryMuscles": [
                "chest",
                "shoulders"
            ],
            "instructions": [
                "Start in a plank position with your forearms on the ground and elbows directly below your shoulders.",
                "Engage your core and keep your body in a straight line from head to toe.",
                "Lower your chest towards the ground by bending your elbows, keeping them close to your body.",
                "Pause for a moment at the bottom, then push yourself back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        }
    ],
    "lower legs": [],
    "neck": [
        {
            "bodyPart": "upper arms",
            "equipment": "barbell",
            "gifUrl": "https://v2.exercisedb.io/image/ee2BGN7JzkIj7E",
            "id": "1718",
            "name": "barbell seated close grip behind neck triceps extension",
            "target": "triceps",
            "secondaryMuscles": [
                "shoulders"
            ],
            "instructions": [
                "Sit on a bench with your back straight and feet flat on the ground.",
                "Hold the barbell with a close grip behind your neck, palms facing forward.",
                "Keep your elbows close to your head and slowly lower the barbell towards the back of your head.",
                "Pause for a moment, then extend your arms back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "back",
            "equipment": "cable",
            "gifUrl": "https://v2.exercisedb.io/image/y-iOHBpwlo8ctQ",
            "id": "1325",
            "name": "cable wide grip rear pulldown behind neck",
            "target": "lats",
            "secondaryMuscles": [
                "biceps",
                "rhomboids",
                "rear deltoids"
            ],
            "instructions": [
                "Adjust the cable machine so that the pulldown bar is at a height above your head.",
                "Sit down on the seat and grab the pulldown bar with a wide overhand grip.",
                "Keep your back straight and your chest up as you lean back slightly.",
                "Pull the bar down towards your upper chest, squeezing your shoulder blades together.",
                "Pause for a moment at the bottom of the movement, then slowly release the bar back up to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "neck",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/PFweFLEmEbJZ4g",
            "id": "1403",
            "name": "neck side stretch",
            "target": "levator scapulae",
            "secondaryMuscles": [
                "trapezius",
                "sternocleidomastoid"
            ],
            "instructions": [
                "Stand or sit up straight with your shoulders relaxed.",
                "Tilt your head to one side, bringing your ear towards your shoulder.",
                "Hold the stretch for 15-30 seconds.",
                "Repeat on the other side.",
                "Perform 2-4 sets on each side."
            ]
        },
        {
            "bodyPart": "neck",
            "equipment": "body weight",
            "gifUrl": "https://v2.exercisedb.io/image/51aRDG0N-FmWp2",
            "id": "0716",
            "name": "side push neck stretch",
            "target": "levator scapulae",
            "secondaryMuscles": [
                "trapezius",
                "sternocleidomastoid"
            ],
            "instructions": [
                "Stand or sit up straight with your shoulders relaxed.",
                "Tilt your head to the right, bringing your right ear towards your right shoulder.",
                "Place your right hand on the left side of your head and gently apply pressure to increase the stretch.",
                "Hold the stretch for 15-30 seconds.",
                "Repeat on the other side, tilting your head to the left and applying pressure with your left hand.",
                "Repeat the stretch 2-3 times on each side."
            ]
        },
        {
            "bodyPart": "shoulders",
            "equipment": "smith machine",
            "gifUrl": "https://v2.exercisedb.io/image/tbs6-XA0CcntiI",
            "id": "0747",
            "name": "smith behind neck press",
            "target": "delts",
            "secondaryMuscles": [
                "triceps",
                "upper back"
            ],
            "instructions": [
                "Adjust the seat height of the smith machine so that the bar is at shoulder level.",
                "Stand with your feet shoulder-width apart and your knees slightly bent.",
                "Grasp the bar with an overhand grip, slightly wider than shoulder-width apart.",
                "Lift the bar off the rack and step back, maintaining a stable stance.",
                "Lower the bar down to the back of your neck, keeping your elbows pointing forward.",
                "Press the bar up overhead until your arms are fully extended.",
                "Pause for a moment at the top, then slowly lower the bar back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        },
        {
            "bodyPart": "shoulders",
            "equipment": "barbell",
            "gifUrl": "https://v2.exercisedb.io/image/fm6fuHMRdT1unm",
            "id": "0788",
            "name": "standing behind neck press",
            "target": "delts",
            "secondaryMuscles": [
                "triceps",
                "upper back"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart and hold the barbell behind your neck with an overhand grip.",
                "Keep your back straight and core engaged.",
                "Press the barbell overhead by extending your arms, fully extending your elbows.",
                "Pause for a moment at the top, then slowly lower the barbell back down to the starting position.",
                "Repeat for the desired number of repetitions."
            ]
        }
    ],
    "shoulders": [],
    "upper arms": [],
    "upper legs": [
        {
            "bodyPart": "shoulders",
            "equipment": "kettlebell",
            "gifUrl": "https://v2.exercisedb.io/image/YbdDtTQTEeuutD",
            "id": "0543",
            "name": "kettlebell pirate supper legs",
            "target": "delts",
            "secondaryMuscles": [
                "triceps",
                "forearms"
            ],
            "instructions": [
                "Stand with your feet shoulder-width apart, holding a kettlebell in one hand.",
                "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
                "Raise the kettlebell up to shoulder height, keeping your elbow close to your body.",
                "Extend your arm fully overhead, straightening your elbow.",
                "Lower the kettlebell back down to shoulder height, then return to the starting position.",
                "Repeat for the desired number of repetitions, then switch sides."
            ]
        }
    ],
    "waist": []
}